

// 정수형
// char, int, long

// 실수형
// ex) float, double, long

// cf) float, double 을 계산 할때는 근사치를 판단하는 명령을 해아한다. 
// ex) 0.5f + 0.5f 는 1.0f 가 아닐수도 있다. 
// 소수점 1자리 이하 자리는 컴퓨터가 0.000000f 가 아니라 가비지 수를 임의로 넣기 때문이다. 

// 유도형
// ex) *, [], struct, union

// 함수형
// ex) printf(), void a()

// cf) 2의 보수를 이용한 뺄샘
// 컴퓨터는 2의 보수(1의보수, 절대값 변경 방법도 있음)를 이용하여 뺄샘을 한다.
// 0000 0001(2) = 1(10) // 1111 1110(2) = -2(10)

// 변수명은 특수기호, 숫자로 시작, 예약어, 변수명사이공백 안됨
// ex) (안되는 예시) 2ver, $ver, int, ver ver

/* --------------자료형 예시-------------------------------*/

//char ch = 64;
//char ch2 = 'a';
//printf("%c %d", ch, ch2);
//printf("%c %d", ch, ch2);

